<a href="https://colab.research.google.com/github/mmecius/turing_college/blob/main/Demo_subproject.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Module 1: Data Science Fundamentals

## Module 1: Data Science Fundamentals
### Sprint 1: Data Wrangling and Storytelling
### Subproject 1: Exploratory Data Analysis

Welcome to the very first subproject of Data Science Fundamentals module. Throughout 3 sprints, you will gain a solid understanding of fundamentals of Data Science. We will master exploratory data analysis (EDA), the bread and butter of data scientists, dive deep into statistical hypothesis testing, and finish-up with modeling (machine learning)! This will prepare you to tackle the capstone project, which will serve as your portfolio item.

The first part focuses focuses on EDA. You will learn how to analyze data, generate statistics, and make informative, eye-catching visualizations.

## Learning outcomes:

- Submit assignments via Github (save work to Github)
- Read datasets from CSVs for analysis with Pandas
- Use basic Pandas functions for Exploratory Data Analysis (EDA)
- Generate Basic Visualizations with Pandas - line charts, scatter plots, histograms.

## Working with Github

Even though saving Colab notebooks is very simple, every data scientist should first understand what GitHub is and how it can be used fully. Go through [uploading your project to Github](https://lab.github.com/githubtraining/uploading-your-project-to-github) tutorial.

### Exercise - your first commit

Your first task is to store this notebook on your personal GitHub. Start by creating a repository and then upload this file (which you can download using "File"->"Download .ipynb").

Now, whenever you make changes to the notebook, select "Save a copy in GitHub" and select your repository - this will create a new commit. Remember to set the commit message to something useful and informative - a sentence explaining what was done. Make sure you commit regularly - this will prevent you from losing work and let us see your progress better.

To test whether saving of the notebook works, change the quoted text in the piece of code below, then save the notebook. Close the window and open the notebook again (you can do this using https://colab.research.google.com/ , selecting the 'GitHub' tab and adding the github link to your notebook). The text should remain changed.

In [ ]:
print('First commit to GitHub')
# https://github.com/mmecius/turing_college/blob/main/Demo_subproject.ipynb

Make sure the repository is public and share the link to it with Turing College.

## Introduction to Pandas

<center><img width="300" src="https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/1200px-Pandas_logo.svg.png" /></center>

To explore the data, we will use Pandas. Pandas is the most popular Python library for [EDA (exploratory data analysis)](https://towardsdatascience.com/exploratory-data-analysis-8fc1cb20fd15). No matter how complex the EDA, everything starts with loading a dataset. Get a grip of [pandas basics](https://www.learnpython.org/en/Pandas_Basics) and go through [importing a CSV dataset into Pandas](https://www.datacamp.com/community/tutorials/pandas-read-csv) tutorial, and let's start with loading the dataset from a CSV.

Key takeways:
* Pandas primary data structure is a `Dataframe`.
* Dictionary of lists == Pandas DataFrame (conceptually). You can treat each column as a key, while column contents - as a list of values.
* Pandas Dataframes unlock a vast amount of operations like grouping, filtering, calculating means, quantiles, unlike standard Python data structures.


### Exercise - loading a dataset

In this exercise, you will learn to load a Pandas dataset. We'll explore 2 methods to load a dataset - from a remote host and from your Colab notebook's local environment.

1. Load a [remote](https://raw.githubusercontent.com/fivethirtyeight/data/master/nba-elo/nbaallelo.csv) dataset into Pandas and assign it to a variable `df1`.
2. Download the same dataset using the provided `wget` command. Read the dataset with Pandas and assign it to a variable `df2`. 
3. Run the assert command to check that the two datasets are indeed the same. The head(x) function also lets you check the first x entries of the dataset - try it out.

In [77]:
# wget is a bash command line program, which is used to download files or website sources from the internet
!wget https://raw.githubusercontent.com/fivethirtyeight/data/master/nba-elo/nbaallelo.csv -O nbaaellelo.csv

--2021-03-16 18:08:54--  https://raw.githubusercontent.com/fivethirtyeight/data/master/nba-elo/nbaallelo.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.110.133, 185.199.111.133, 185.199.109.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.110.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 18173265 (17M) [text/plain]
Saving to: ‘nbaaellelo.csv’

nbaaellelo.csv      100%[===================>]  17.33M  41.1MB/s    in 0.4s

2021-03-16 18:08:55 (41.1 MB/s) - ‘nbaaellelo.csv’ saved [18173265/18173265]

In [79]:
import pandas as pd

url = 'https://raw.githubusercontent.com/fivethirtyeight/data/master/nba-elo/nbaallelo.csv'
data = pd.read_csv(url)

csv_file = 'nbaaellelo.csv'
data2 = pd.read_csv(csv_file)

df1 = pd.DataFrame(data)
df2 = pd.DataFrame(data2)

In [80]:
assert df1.equals(df2)

In [81]:
print("Rows, columns:")
df1.shape

Rows, columns:

(126314, 23)

In [82]:
print('Columns names:')
df1.columns

Columns names:

Index(['gameorder', 'game_id', 'lg_id', '_iscopy', 'year_id', 'date_game',
       'seasongame', 'is_playoffs', 'team_id', 'fran_id', 'pts', 'elo_i',
       'elo_n', 'win_equiv', 'opp_id', 'opp_fran', 'opp_pts', 'opp_elo_i',
       'opp_elo_n', 'game_location', 'game_result', 'forecast', 'notes'],
      dtype='object')

In [83]:
print('Not a number or junk data:')
df1.isna()

Not a number or junk data:

        gameorder  game_id  lg_id  ...  game_result  forecast  notes
0           False    False  False  ...        False     False   True
1           False    False  False  ...        False     False   True
2           False    False  False  ...        False     False   True
3           False    False  False  ...        False     False   True
4           False    False  False  ...        False     False   True
...           ...      ...    ...  ...          ...       ...    ...
126309      False    False  False  ...        False     False   True
126310      False    False  False  ...        False     False   True
126311      False    False  False  ...        False     False   True
126312      False    False  False  ...        False     False   True
126313      False    False  False  ...        False     False   True

[126314 rows x 23 columns]

Only notes column has data not suitable for analysis.

In [89]:
print('check last rows for empty rows:')
df1.tail()
clean_df = df1.dropna()
clean_df.tail()

check last rows for empty rows:

        gameorder  ...                                      notes
122207      61104  ...                         at London, England
123916      61959  ...  at Mexico City Arena, Mexico City, Mexico
123917      61959  ...  at Mexico City Arena, Mexico City, Mexico
124862      62432  ...                 at The O2, London, England
124863      62432  ...                 at The O2, London, England

[5 rows x 23 columns]

No need to remove data from last row.

In [88]:
df1.head(5)

   gameorder       game_id lg_id  ...  game_result  forecast notes
0          1  194611010TRH   NBA  ...            L  0.640065   NaN
1          1  194611010TRH   NBA  ...            W  0.359935   NaN
2          2  194611020CHS   NBA  ...            W  0.631101   NaN
3          2  194611020CHS   NBA  ...            L  0.368899   NaN
4          3  194611020DTF   NBA  ...            L  0.640065   NaN

[5 rows x 23 columns]

When a dataframe has too many rows to fit the page, it's often convenient to `transpose` the dataframe with `.T`. Try it!

In [12]:
df1.head().T

                          0             1  ...             3             4
gameorder                 1             1  ...             2             3
game_id        194611010TRH  194611010TRH  ...  194611020CHS  194611020DTF
lg_id                   NBA           NBA  ...           NBA           NBA
_iscopy                   0             1  ...             1             0
year_id                1947          1947  ...          1947          1947
date_game         11/1/1946     11/1/1946  ...     11/2/1946     11/2/1946
seasongame                1             1  ...             2             1
is_playoffs               0             0  ...             0             0
team_id                 TRH           NYK  ...           NYK           DTF
fran_id             Huskies        Knicks  ...        Knicks       Falcons
pts                      66            68  ...            47            33
elo_i                  1300          1300  ...       1306.72          1300
elo_n               1293.28       1306.72  ...       1297.07       1279.62
win_equiv           40.2948       41.7052  ...       40.6928        38.864
opp_id                  NYK           TRH  ...           CHS           WSC
opp_fran             Knicks       Huskies  ...         Stags      Capitols
opp_pts                  68            66  ...            63            50
opp_elo_i              1300          1300  ...          1300          1300
opp_elo_n           1306.72       1293.28  ...       1309.65       1320.38
game_location             H             A  ...             A             H
game_result               L             W  ...             L             L
forecast           0.640065      0.359935  ...      0.368899      0.640065
notes                   NaN           NaN  ...           NaN           NaN

[23 rows x 5 columns]

## Basic Pandas functions for EDA

You don't have to be all fancy and smart to perform basic EDA. Most of EDA features several basic operations, and Pandas the process accessible.

## Basic descriptive statistics

[Mean](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.mean.html) value, [Median](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.median.html) value, [standard deviation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.std.html), [minimum](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.min.html), [maximum](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.max.html) values, [quantiles](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.quantile.html). These are the data properties you should explore first.

In [91]:
print('Mean:')
df1['pts'].mean()

Mean:

102.72998242475101

In [93]:
print('Median:')
df1['pts'].median()

Median:

103.0

In [98]:
print('Mode:')
df1['pts'].mode()

Mode:

0    102
dtype: int64

In [99]:
print('Standard deviation:')
df1['pts'].std()

Standard deviation:

14.81484465438546

In [100]:
print('Minimum:')
df1['pts'].min()

Minimum:

0

In [101]:
print('Maximum:')
df1['pts'].max()

Maximum:

186

In [102]:
print('Quantile:')
df1['pts'].quantile()

Quantile:

103.0

### Exercise - exploring the scores

Calculate the mean `avg_pts`, `median_pts`, minimum `min_pts` and maximum `max_pts` values of points scored by NBA players using the dataset loaded before. To make things spicy, calculate quantiles at every 5% `quantiles`. How does the distribution look like? Why?

In [112]:
avg_pts = df1['pts'].mean()
print(avg_pts)
median_pts = df1['pts'].median()
print(median_pts)
min_pts = df1['pts'].min()
print(min_pts)
max_pts = df1['pts'].max()
print(max_pts)
# Check how to count it
quantiles = df1['pts'].quantile(0.05) 
print(quantiles)

102.72998242475101
103.0
0
186
79.0

In [122]:
df1['pts'].duplicated()

0         False
1         False
2         False
3         False
4         False
          ...
126309     True
126310     True
126311     True
126312     True
126313     True
Name: pts, Length: 126314, dtype: bool

In [105]:
import numpy as np

assert round(avg_pts, 1) == 102.7
assert round(median_pts, 1) == 103
assert round(max_pts, 2) == 186
assert round(min_pts, 2) == 0

In [164]:
df1_pts =  df1['pts']
nump_array = np.array(df1_pts)
print(nump_array)

# a = np.quantile(nump_array, 0.05)
# print(a)

test=[np.quantile(number, 0.05 * number) for number in range(0,21)]
print(test)

[ 66  68  63 ...  91  97 105]
[0.0, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0, 11.0, 12.0, 13.0, 14.0, 15.0, 16.0, 17.0, 18.0, 19.0, 20.0]

In [106]:
np.testing.assert_array_almost_equal(quantiles,  
  [0.0,
  79.0,
  84.0,
  88.0,
  91.0,
  93.0,
  95.0,
  97.0,
  99.0,
  101.0,
  103.0,
  104.0,
  106.0,
  108.0,
  110.0,
  112.0,
  115.0,
  118.0,
  122.0,
  127.0])

AssertionError: ignored

## Grouping, Aggregations

Read this [tutorial](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html#GroupBy:-Split,-Apply,-Combine) from Data Science Handbook to get familiar with the philosophy of groupby and the API of grouping in Pandas.

### Exercise - slice and measure

Global statistics are biased - not all teams score 100 points per game, some teams performs above average.

Find 5 teams (by fran_id) with most average points scored per game. Save as `five_best_teams`.

In [76]:
# df1['fran_id']
# df1['pts'].sort_values(ascending=False, )
df1['pts'].max()

# df1.groupby('fran_id').count().sort_values('pts',ascending=False)

186

In [ ]:
np.testing.assert_array_almost_equal(five_best_teams["pts"].values, [115.44651163, 114.05131414, 112.65454545, 112.35449735, 111.62529551])

## Basic Visualizations

Although at the end of this week you will have learned some fancy ways of visualizing data with matplotlib and Seaborn, Pandas exposes some basic visualization API, which is quite useful for many basic cases.

Let's start with some readings. Go through a official Pandas [tutorial](https://pandas.pydata.org/docs/user_guide/visualization.html) on the visualizations API. Copy-paste the code, try to run it in the notebook.

### Exercise - let's visualize the games!

Visualize top 10 teams who score most / least on average per play. Use a bar chart for that.

You should see a result as follows:
<div><img src="https://i.imgur.com/io7fvju.png" /></div>

You should see a result as follows:
<div><img src="https://i.imgur.com/6VXMksY.png" /></div>

Now try to visualize all team scores the same way.

You should see a result as follows:
<div><img src="https://i.imgur.com/L2iTGuC.png" /></div>

The results do not seem that intriguing. Although, it seems that the slope of 60-95 scoring teams and 100-120 is steeper than mid-section of the curve. Which indicates that most teams score around 100 points.

A histogram could enhance these frequency differences. Plot the data with a `hist` type with 20 bins. Would you guess what kind of distribution does it (nearly) follow?

You should see a result as follows:
<div><img src="https://i.imgur.com/Pc3sUKN.png"/></div>

Seems like most teams do score ~100 - 105 points per game. The kind of distribution on the right is called a skewed Normal Distribution.

There's one more often used plot type to explore - a **line chart**. Your task is to visualize Los Angeles Lakers wins per years. Which year has been most successful for the team?

From the chart, it should be clear that LAL success is periodic - 10 to 20 years they win about 80 times per year.

## Exercise

For our last exercise for the day, we'll be exploring statistics of U.S. births.

Here's the [link](https://raw.githubusercontent.com/fivethirtyeight/data/master/births/US_births_2000-2014_SSA.csv) to the dataset.

Your objective is to answer the following questions:

* How does the month impact childbirth?
* Have there been any significants ups / downs in chilbirth throughout the years? Could you explain them?
* Which days of the week children are born most frequently on?
* What's the lowest/biggest amount of childbirths per month?
* Which months are most / least predictable in terms of childbirth? (hint - use standard deviation)

Requirements:
* Dataset is loaded from a remote CSV.
* Basic EDA Pandas statistical functions are used (min, max, mean, std).
* Grouping and aggregations.
* Charts used: line, bar plot.

In [33]:
import pandas as pd

# U.S. Births EDA:
url = 'https://raw.githubusercontent.com/fivethirtyeight/data/master/births/US_births_2000-2014_SSA.csv'

data = pd.read_csv(url)

# loading data into Dataframe
df = pd.DataFrame(data)

In [32]:
df.shape

(5479, 5)

In [26]:
df.columns

Index(['year', 'month', 'date_of_month', 'day_of_week', 'births'], dtype='object')

In [ ]:
'year'

In [68]:
df['births'].mean()

11350.068260631502

In [75]:
df.groupby('births').max()

        year  month  date_of_month  day_of_week
births
5728    2011     12             25            7
6159    2010     12             25            6
6160    2009     12             25            5
6224    2005     12             25            7
6259    2004     12             25            6
...      ...    ...            ...          ...
15454   2006      9              7            4
15555   2007     12             28            5
15590   2007     12             27            4
15645   2008     12             30            2
16081   2009      9              9            3

[3381 rows x 4 columns]

In [46]:
df['month'].median()

7.0

In [54]:
df['month'].std()

3.449074592963165

In [49]:
df['day_of_week'].median()

4.0

In [39]:
df['day_of_week'].head().T

0    6
1    7
2    1
3    2
4    3
Name: day_of_week, dtype: int64

In [64]:
df.groupby('day_of_week').median()

               year  month  date_of_month   births
day_of_week
1            2007.0    7.0           16.0  12087.0
2            2007.0    7.0           16.0  13198.0
3            2007.0    7.0           16.0  12932.0
4            2007.0    7.0           16.0  12958.0
5            2007.0    7.0           16.0  12632.5
6            2007.0    7.0           16.0   8574.0
7            2007.0    7.0           16.0   7512.0

In [27]:
df.shape

(5479, 5)

In [28]:
df.head(5)

   year  month  date_of_month  day_of_week  births
0  2000      1              1            6    9083
1  2000      1              2            7    8006
2  2000      1              3            1   11363
3  2000      1              4            2   13032
4  2000      1              5            3   12558

In [29]:
df.head().T

                  0     1      2      3      4
year           2000  2000   2000   2000   2000
month             1     1      1      1      1
date_of_month     1     2      3      4      5
day_of_week       6     7      1      2      3
births         9083  8006  11363  13032  12558

In [30]:
df.isna()

       year  month  date_of_month  day_of_week  births
0     False  False          False        False   False
1     False  False          False        False   False
2     False  False          False        False   False
3     False  False          False        False   False
4     False  False          False        False   False
...     ...    ...            ...          ...     ...
5474  False  False          False        False   False
5475  False  False          False        False   False
5476  False  False          False        False   False
5477  False  False          False        False   False
5478  False  False          False        False   False

[5479 rows x 5 columns]

In [31]:
df.tail()

      year  month  date_of_month  day_of_week  births
5474  2014     12             27            6    8656
5475  2014     12             28            7    7724
5476  2014     12             29            1   12811
5477  2014     12             30            2   13634
5478  2014     12             31            3   11990

In [57]:
df.head().min()

year             2000
month               1
date_of_month       1
day_of_week         1
births           8006
dtype: int64

In [58]:
df.head().max()

year              2000
month                1
date_of_month        5
day_of_week          7
births           13032
dtype: int64

In [59]:
df.head().mean()

year              2000.0
month                1.0
date_of_month        3.0
day_of_week          3.8
births           10808.4
dtype: float64

In [60]:
df.head().std()

year                0.000000
month               0.000000
date_of_month       1.581139
day_of_week         2.588436
births           2187.665948
dtype: float64

Seems like there's a significantly lower amount of births during weekends. Could it be that on weekdays there are more doctors in hospitals? Source: https://www.sciencedaily.com/releases/2007/09/070925130026.htm.

People seem to be making children in winter, just before Christmas.

Pre-economical crysis baby boom?

Seems like childbirth varies most towards the end of a year.

-------

## Summary

Basic EDA is what data scientists always do with when starting to work with a new dataset. It's an essential skill to possess. Though, data comes in all shapes and flavors. There's much more to plotting than Pandas APIs. This is what we'll focus on in subsequent chapters.